def mod_settings(): 
    # Функція з налаштуваннями модуля
    # У цій функції ви можете написати налаштування вашого модуля. Приклад:
    global mod_version
    mod_version = "0.0.1" # Версія модуля
    global mod_name
    mod_name = "MyTestMod"

def mod(): 
    # Ваш модуль
    # Функція, в якій ви пишете код для вашого модуля
    # Додайте ваш код модуля тут
    print("Mod function executed.")

def mod_start():
    # Головна функція модуля
    # Головна функція, яку буде запускати SXServiseCLI
    # Додайте свій код, щоб налаштувати середовище перед запуском модуля
    print("Mod started.") # Повідомлення: Модуль запущено
    # Викликайте функцію для вашого модуля
    mod() # Запуск модуля

# Почніть модуль при запуску програми
if __name__ == "__main__":
    mod_start()
